---
kind: property
id: P:Autodesk.Revit.DB.ExportLayerInfo.CategoryType
source: html/e04b3dca-a39a-80f6-cd2d-970a2d53accf.htm
---
# Autodesk.Revit.DB.ExportLayerInfo.CategoryType Property

The category type which this layer belongs to.

## Syntax (C#)
```csharp
public LayerCategoryType CategoryType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration